#+TITLE:DataCamp EDA in R 2
#+AUTHOR: DataCamp / Andrew Bray & Lyon College / Marcus Birkenkrahe
#+SUBTITLE:DataCamp EDA in R
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session "*EDA in R*" :exports both :results output :comments both
* Import the data

  * [ ] Download the raw data ~Comics data~ [[https://app.datacamp.com/learn/courses/exploratory-data-analysis-in-r][from DataCamp]] to your PC
    into a directory ~./data/~

  * [ ] Read the data set into an R data frame named ~comics~ and check
    the structure of the data frame.

    #+begin_src R
      comics <- read.csv("data/comics.csv", header=TRUE, stringsAsFactors=TRUE)
      str(comics)
    #+end_src

    #+RESULTS:
    #+begin_example
    'data.frame':	23272 obs. of  11 variables:
     $ name        : Factor w/ 23272 levels "'Spinner (Earth-616)",..: 19830 3335 22769 9647 20956 2220 17576 9347 18794 10957 ...
     $ id          : Factor w/ 4 levels "No Dual","Public",..: 3 2 2 2 1 2 2 2 2 2 ...
     $ align       : Factor w/ 4 levels "Bad","Good","Neutral",..: 2 2 3 2 2 2 2 2 3 2 ...
     $ eye         : Factor w/ 26 levels "Amber Eyes","Auburn Hair",..: 11 5 5 5 5 5 6 6 6 5 ...
     $ hair        : Factor w/ 28 levels "Auburn Hair",..: 7 27 3 3 4 14 7 7 7 4 ...
     $ gender      : Factor w/ 3 levels "Female","Male",..: 2 2 2 2 2 2 2 2 2 2 ...
     $ gsm         : Factor w/ 6 levels "Bisexual Characters",..: NA NA NA NA NA NA NA NA NA NA ...
     $ alive       : Factor w/ 2 levels "Deceased Characters",..: 2 2 2 2 2 2 2 2 2 2 ...
     $ appearances : int  4043 3360 3061 2961 2258 2255 2072 2017 1955 1934 ...
     $ first_appear: Factor w/ 1606 levels "1935, October",..: 874 1278 1513 1296 1424 1432 1432 1364 1570 1432 ...
     $ publisher   : Factor w/ 2 levels "dc","marvel": 2 2 2 2 2 2 2 2 2 2 ...
    #+end_example

